



INSERT INTO position (ID_position, ID_rak, qtd_itens, date_of_cadastro, data_of_alteration, login_alteration)
VALUES

(1, 1, 4, '2024-03-14', '2024-03-14T11:30:00', 'admin'),
(2, 1, 7, '2024-03-15', '2024-03-15T10:15:00', 'user1'),
(3, 1, 5, '2024-03-16', '2024-03-16T14:45:00', 'user2'),
(4, 2, 9, '2024-03-17', '2024-03-17T09:50:00', 'admin'),
(5, 2, 2, '2024-03-18', '2024-03-18T13:20:00', 'user1'),
(6, 2, 6, '2024-03-19', '2024-03-19T11:40:00', 'user2'),
(7, 3, 3, '2024-03-20', '2024-03-20T15:00:00', 'admin'),
(8, 3, 8, '2024-03-21', '2024-03-21T10:30:00', 'user1'),
(9, 3, 1, '2024-03-22', '2024-03-22T14:10:00', 'user2'),
(10, 4, 5, '2024-03-23', '2024-03-23T09:45:00', 'admin'),
(11, 4, 10, '2024-03-24', '2024-03-24T13:30:00', 'user1'),
(12, 4, 4, '2024-03-25', '2024-03-25T11:50:00', 'user2'),
(13, 5, 2, '2024-03-26', '2024-03-26T14:20:00', 'admin'),
(14, 5, 7, '2024-03-27', '2024-03-27T10:10:00', 'user1'),
(15, 5, 3, '2024-03-28', '2024-03-28T12:40:00', 'user2');




INSERT INTO Itens (ID_itens, ID_position, ID_rak, name_product, value_product, date_of_cadastro, data_of_alteration, login_alteration, status)
VALUES

(1, 1, 1, 'Arroz', 10.99, '2024-03-14', '2024-03-14T11:30:00', 'admin', 'Disponível'),
(2, 2, 1, 'Feijão', 4.99, '2024-03-15', '2024-03-15T10:15:00', 'user1', 'Disponível'),
(3, 3, 1, 'Azeite de Oliva', 19.99, '2024-03-16', '2024-03-16T14:45:00', 'user2', 'Disponível'),
(4, 4, 1, 'Sabão em Pó', 8.49, '2024-03-17', '2024-03-17T09:50:00', 'admin', 'Disponível'),
(5, 5, 1, 'Detergente', 3.99, '2024-03-18', '2024-03-18T13:20:00', 'user1', 'Disponível'),
(6, 6, 1, 'Macarrão', 2.99, '2024-03-19', '2024-03-19T11:40:00', 'user2', 'Disponível'),
(7, 7, 2, 'Leite', 2.49, '2024-03-20', '2024-03-20T15:00:00', 'admin', 'Disponível'),
(8, 8, 2, 'Café', 7.99, '2024-03-21', '2024-03-21T10:30:00', 'user1', 'Disponível'),
(9, 9, 2, 'Chocolate', 4.49, '2024-03-22', '2024-03-22T14:10:00', 'user2', 'Disponível'),
(10, 10, 2, 'Creme Dental', 2.79, '2024-03-23', '2024-03-23T09:45:00', 'admin', 'Disponível'),
(11, 11, 2, 'Shampoo', 12.99, '2024-03-24', '2024-03-24T13:30:00', 'user1', 'Disponível'),
(12, 12, 2, 'Condicionador', 11.49, '2024-03-25', '2024-03-25T11:50:00', 'user2', 'Disponível'),
(13, 13, 3, 'Desodorante', 7.99, '2024-03-26', '2024-03-26T14:20:00', 'admin', 'Disponível'),
(14, 14, 3, 'Laptop', 1200.00, '2024-03-27', '2024-03-27T10:10:00', 'user1', 'Disponível'),
(15, 15, 3, 'Smartphone', 800.00, '2024-03-28', '2024-03-28T12:40:00', 'user2', 'Disponível'),
(16, 14, 4, 'Notebook', 1499.99, '2024-03-29', '2024-03-29T14:45:00', 'admin', 'Disponível'),
(17, 14, 4, 'Smart TV 50 polegadas', 799.99, '2024-03-30', '2024-03-30T10:30:00', 'user1', 'Disponível'),
(18, 14, 4, 'Fone de Ouvido Bluetooth', 79.99, '2024-03-31', '2024-03-31T14:10:00', 'user2', 'Disponível'),
(19, 14, 4, 'Câmera DSLR', 999.99, '2024-04-01', '2024-04-01T09:45:00', 'admin', 'Disponível'),
(20, 14, 4, 'Impressora Multifuncional', 249.99, '2024-04-02', '2024-04-02T13:30:00', 'user1', 'Disponível'),
(21, 14, 4, 'Console de Videogame', 349.99, '2024-04-03', '2024-04-03T11:50:00', 'user2', 'Disponível'),
(22, 15, 5, 'Camiseta Casual', 19.99, '2024-04-04', '2024-04-04T14:20:00', 'admin', 'Disponível'),
(23, 15, 5, 'Calça Jeans', 39.99, '2024-04-05', '2024-04-05T10:10:00', 'user1', 'Disponível'),
(24, 15, 5, 'Vestido de Festa', 89.99, '2024-04-06', '2024-04-06T12:40:00', 'user2', 'Disponível'),
(25, 15, 5, 'Sapato Social', 59.99, '2024-04-07', '2024-04-07T09:45:00', 'admin', 'Disponível'),
(26, 15, 5, 'Bolsa de Couro', 49.99, '2024-04-08', '2024-04-08T13:30:00', 'user1', 'Disponível'),
(27, 15, 5, 'Óculos de Sol', 29.99, '2024-04-09', '2024-04-09T11:50:00', 'user2', 'Disponível');









